; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v6 - type_2 ?v7 - type_1)
 	      (pred_1 ?v2 - object ?v7 - type_1)
	      (pred_4 ?v6 - type_2 ?v4 - type_3)
	      (pred_2 ?v6 - type_2 ?v2 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v6 - type_2 ?v8 ?v3 - type_1)
       :precondition (and  (pred_3 ?v6 ?v8))
       :effect (and  (pred_3 ?v6 ?v3)
		     (not (pred_3 ?v6 ?v8))))

   (:action op_1
       :parameters (?v6 - type_2 ?v1 - object ?v5 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v5) (pred_3 ?v6 ?v5) (pred_4 ?v6 ?v4))
       :effect (and (pred_2 ?v6 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v5)) 
		    (not (pred_4 ?v6 ?v4))))

   (:action op_2
       :parameters (?v6 - type_2 ?v1 - object ?v5 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v1 ?v4) (pred_3 ?v6 ?v5))
       :effect (and (pred_1 ?v1 ?v5)
		    (pred_4 ?v6 ?v4)
		    (not (pred_2 ?v6 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_06 - type_2
obj_07 obj_12 obj_01 obj_09 - type_3
obj_04 obj_13 obj_03 obj_08 - type_1
obj_11 obj_02 obj_10 - object)
(:init
(pred_3 obj_05 obj_13)
(pred_4 obj_05 obj_07)
(pred_4 obj_05 obj_12)
(pred_3 obj_06 obj_13)
(pred_4 obj_06 obj_01)
(pred_4 obj_06 obj_09)
(pred_1 obj_11 obj_04)
(pred_1 obj_02 obj_08)
(pred_1 obj_10 obj_03)
)
(:goal
(and
(pred_1 obj_11 obj_13)
(pred_1 obj_02 obj_03)
(pred_1 obj_10 obj_13)
)
)

(:constraints
  (always (not (pred_3 obj_05 obj_03)))
)
)

; plan
1. (op_3 obj_05 obj_13 obj_04)
   deleted: (pred_3 obj_05 obj_13)
   added: (pred_3 obj_05 obj_04)
   goals met: 0 of 3
2. (op_3 obj_06 obj_13 obj_08)
   deleted: (pred_3 obj_06 obj_13)
   added: (pred_3 obj_06 obj_08)
   goals met: 0 of 3
3. (op_1 obj_05 obj_11 obj_04 obj_12)
   deleted: (pred_1 obj_11 obj_04) (pred_4 obj_05 obj_12)
   added: (pred_2 obj_05 obj_11 obj_12)
   goals met: 0 of 3
4. (op_1 obj_06 obj_02 obj_08 obj_09)
   deleted: (pred_1 obj_02 obj_08) (pred_4 obj_06 obj_09)
   added: (pred_2 obj_06 obj_02 obj_09)
   goals met: 0 of 3
5. (op_3 obj_05 obj_04 obj_13)
   deleted: (pred_3 obj_05 obj_04)
   added: (pred_3 obj_05 obj_13)
   goals met: 0 of 3
6. (op_3 obj_06 obj_08 obj_03)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_03)
   goals met: 0 of 3
7. (op_2 obj_05 obj_11 obj_13 obj_12)
   deleted: (pred_2 obj_05 obj_11 obj_12)
   added: (pred_1 obj_11 obj_13) (pred_4 obj_05 obj_12)
   goals met: 1 of 3
8. (op_2 obj_06 obj_02 obj_03 obj_09)
   deleted: (pred_2 obj_06 obj_02 obj_09)
   added: (pred_1 obj_02 obj_03) (pred_4 obj_06 obj_09)
   goals met: 2 of 3
9. (op_1 obj_06 obj_10 obj_03 obj_01)
   deleted: (pred_1 obj_10 obj_03) (pred_4 obj_06 obj_01)
   added: (pred_2 obj_06 obj_10 obj_01)
   goals met: 2 of 3
10. (op_3 obj_06 obj_03 obj_13)
   deleted: (pred_3 obj_06 obj_03)
   added: (pred_3 obj_06 obj_13)
   goals met: 2 of 3
11. (op_2 obj_06 obj_10 obj_13 obj_01)
   deleted: (pred_2 obj_06 obj_10 obj_01)
   added: (pred_1 obj_10 obj_13) (pred_4 obj_06 obj_01)
   goals met: 3 of 3
